# Базовий образ контейнера
FROM python:3.12-slim

# Встановимо робочу директорію всередині контейнера
WORKDIR /app

# Скопіюємо файл з залежностями
COPY requirements.txt .

# Встановимо залежності всередині контейнера
RUN pip install --no-cache-dir -r requirements.txt

# Скопіюємо інші файли в робочу директорію контейнера
COPY . .

# Позначимо порт, де працює застосунок всередині контейнера
EXPOSE 3000

# Запустимо наш застосунок всередині контейнера
ENTRYPOINT ["python", "/app/src/modules/main.py"]